<?php

namespace Database\Seeders;
use DB;

use Illuminate\Database\Seeder;

class BlocksTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('main_blocks')->insert([
            'title' => 'Стипендіальне забезпечення',
            'text' => 'Уряд затвердив новий Порядок
            призначення і виплати стипендій
            учням професійно-технічних,
            студентам (курсантам) вищих
            державних та комунальних
            навчальних закладів...',
            'link' => 'http://socstor-test.sumdu.edu.ua/scholarship',
            'type' => '0'
        ]);
        DB::table('main_blocks')->insert([
            'title' => 'Фотоальбоми',
            'text' => 'Уряд затвердив новий Порядок
            призначення і виплати стипендій
            учням професійно-технічних,
            студентам (курсантам) вищих
            державних та комунальних
            навчальних закладів...',
            'link' => 'http://socstor-test.sumdu.edu.ua/albums',
            'type' => '0'
        ]);
        DB::table('main_blocks')->insert([
            'title' => 'Карта добрих справ',
            'text' => 'Карта добрих справ - це
            наглядний приклад того, що наші
            волонтери дійсно допомагають
            усій Україні, від Львова до
            Луганська. Ми ділимось добром зі
            школами, дитсадками...',
            'link' => 'http://socstor-test.sumdu.edu.ua/map',
            'type' => '0'
        ]);
        DB::table('main_blocks')->insert([
            'title' => 'Розміри стипендій студентів вищих навчальних закладів',
            'text' => 'Розмір мінімальної ординарної (звичайної) академічної стипендії:

            • для студентів вищих навчальних закладів III - IV рівня акредитації, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", крім тих, що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються академічні стипендії у підвищеному розмірі, - 1100 гривень на місяць;
            
            • для студентів вищих навчальних закладів III - IV рівня акредитації, наукових установ, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються академічні стипендії у підвищеному розмірі, - 1400 гривень на місяць. 
            
            Розмір соціальної стипендії для студентів вищих навчальних закладів з числа дітей-сиріт та дітей, позбавлених батьківського піклування, осіб з їх числа, а також студентів, які в період навчання у віці від 18 до 23 років залишилися без батьків: 
            
            • становить - 2000 гривень на місяць. ',
            'type' => '1'
        ]);
        DB::table('main_blocks')->insert([
            'title' => 'Перелік спеціальностей, для яких встановлюються академічні стипендії у підвищеному розмірі в СумДУ',
            'text' => 'Розмір мінімальної ординарної (звичайної) академічної стипендії: • для студентів вищих навчальних закладів III - IV рівня акредитації, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", крім тих, що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються академічні стипендії у підвищеному розмірі, - 1100 гривень на місяць; • для студентів вищих навчальних закладів III - IV рівня акредитації, наукових установ, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються ',
            'type' => '1'
        ]);
        DB::table('main_blocks')->insert([
            'title' => 'Нормативні документи згідно яких відбувається призначення академічних та соціальних стипендій',
            'text' => '• для студентів вищих навчальних закладів III - IV рівня акредитації, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", крім тих, що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються академічні стипендії у підвищеному розмірі, - 1100 гривень на місяць;

            • для студентів вищих навчальних закладів III - IV рівня акредитації, наукових установ, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються академічні стипендії у підвищеному розмірі, - 1400 гривень на місяць.
            
            • для студентів вищих навчальних закладів III - IV рівня акредитації, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", крім тих, що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються академічні стипендії у підвищеному розмірі, - 1100 гривень на місяць;
            
            • для студентів вищих навчальних закладів III - IV рівня акредитації, наукових установ, які навчаються за освітньо-кваліфікаційним рівнем "бакалавр", "спеціаліст" або "магістр", що навчаються за спеціальностями (спеціалізаціями), для яких встановлюються академічні стипендії у підвищеному розмірі, - 1400 гривень на місяць.',
            'type' => '1'
        ]);
    }
}
