<?php

namespace Database\Seeders;
use DB;

use Illuminate\Database\Seeder;

class NewsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Акція 'Життя в стилі еко'",
            'text' => '
            14 грудня волонтери СумДУ долучилися до заходу Життя в стилі еко, що організували співробітники бібліотеки університету.
            Волонтери СумДУ виступили з презентацією та розповіли про проведені акції по очищенню та озелененню міста, що проводили протягом року. Також показали фотографії та провели міні-вікторину.
            У такий спосіб, ми мотивуємо школярів до збереження та очищення довкілля, пропагуємо економію невідтворювальних ресурсів та залучаємо всіх охочих до співпраці, - говорить волонтер Катя Богомолова.
            На заході школярі та студенти різних навчальних закладів представляли свої роботи з екологічних матеріалів.
            ',
            'photo' => '',
            'slug' => '10',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-01-4 16:22:44',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Новорічна казка для вихованців центру \"Злагода\"",
            'text' => '
            21 грудня волонтери СумДУ разом із студентами соціальної служби організували справжнє свято для вихованців реабілітаційного центру \"Злагода\".
            Вони підготували новорічну казку, яку самі й придумали. Там були присутні різні казкові герої: Дід Мороз, Снігурочка, Баба Яга, Кікімора, Лєший, Завірюха та навіть Мушкетери, а також символ нового року Свинка.
            У кінці заходу вихованці закладу презентували волонтерам дуже ніжний танець, який справив приємне враження. За такий гарний сюрприз вони отримали солодкі подарунки від Діда Мороза.
            ',
            'photo' => '',
            'slug' => '9',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-01-14 16:23:50',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Акція \"Ялинка янголів\"",
            'text' => '28 грудня відвідали Центр соціально-психічної реабілітації для дітей області у м.Суми.
            У рамках акції "Ялинка янголів", що організовує адміністрація ТЦ "Універмаг "Київ", допомогли роздати діткам новорічні подарунки та провели кілька веселих ігор',
            'photo' => '',
            'slug' => '8',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-01-14 16:25:19',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Дива перед Різдвом",
            'text' => 'Перед Різдвом відвідали нашого давнього друга з Правдинської школи-інтернату. Саша Орленко потрапив у лікарню з опіками кінцівок - волонтери СумДУ завітали в гості та принесли новорічні подарунки, кошти на ліки та поспілкувалися з ним.',
            'photo' => '',
            'slug' => '7',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-01-14 16:27:12',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Акція \"Обійми для всіх\"",
            'text' => '
            21 січня відзначається Міжнародний день обіймів. У цей день по всьому світу люди намагаються обійняти як можна більше людей, навіть незнайомих. Це свято прийшло до нас із Сполучених Штатів Америки, і швидко поширилось серед молоді. Волонтери СумДУ не залишились осторонь і з усією душевною добротою та гарним настроєм вийшли на центральні вулиці міста. 
            
            \"Ми мали на меті поділитися емоціями з незнайомцями та загартуватися, - повідомила волонтер Вікторія Гичкаленко. - Адже доброзичливі обійми підвищують імунітет\". Обійшли декілька вулиць, обійняли близько 300 осіб і роздали понад 100 цукерок. 
            
            У рамках акції усі, від дітей до людей похилого віку, могли отримати смаколик, обмінявши усмішку на цукерку. Без виключень, волонтери обіймали усіх, хто траплявся на шляху.
            Волонтери СумДУ вбачають проблему суспільства в недоброзичливому ставленні та недовірі людей до один одного. 
            
            \"Маленькими кроками ми намагаємося змінити ситуацію та показати оточенню, що добрі люди бувають, що набагато краще жити у довірі та щирості\", - говорить волонтер Аня Тарануха.
            Сьогодні акція набула нових масштабів, адже представники волонтерського руху СумДУ провели паралельно акцію в Києві, за що дякуємо Єгору Ганжі. Він підходив до перехожих, аби обмінятися з ними приємними словами, а за гарний настрій дарував цукерки. 
            
            Також у цей день відвідали будинок дитини на вул. Герасима-Кондратьєва, передали маленьким діткам, зібрані раніше, м\'які іграшки та декілька упаковок підгузків, придбання яких проспонсорував випускник СумДУ Винниченко Богдан.
            ',
            'photo' => '',
            'slug' => '6',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-01-22 10:28:55',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "«Допомога чотирилапим»",
            'text' => '
            26 січня волонтери СумДУ вкотре відвідали центр перетримки тварин.  До вже сформованої групи долучилися і нові студенти-волонтери, які  із задоволенням вигуляли більше 20 собачок. Також силами студентів була зібрана сума, на яку закупили м’яса та кілька поводків. Хлопці ж взяли до рук лопати та допомогли волонтерам центру розкидати купу снігу. 

«Я ходжу сюди просто так, інколи без акції, а чисто для себе, - говорить волонтер Наташа Петренко. – Мені подобається гуляти з собаками, у кожної свій неповторний характер, абсолютно унікальна зовнішність, але всі вони хочуть любові. А я її можу дати».

            ',
            'photo' => '',
            'slug' => '5',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-01-28 16:39:05',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Кращі студенти СумДУ на екскурсії у ВРУ",
            'text' => '
            5 лютого волонтери Сумського державного університету разом із студентами кафедри психології, політології та соціокультурних технологій побували у Києві.

Найактивніші студенти-волонтери та студенти, які пов’язані з євроінтеграційними процесами отримали можливість відвідати Верховну Раду України.

Екскурсію було організовано нардепом України Олегом Медуницею. Студентів провели поверхами будівлі, дали змогу відчути себе депутатами. Показали і синьо-жовтий прапор, який був внесений депутатами до сесійної зали Верховної Ради у 1991 році, історичні картини, які прикрашають стіни приміщення, балкони, звідки видно робочі місця нардепів, кулуари та багато іншого. Вразила студентів й історія самої будівлі та сесійної зали. Дуже сподобалася пропозиція зблизька роздивитися місця законотворців та уявити себе на їх місці. Побачене справило сильне враження.

«Сама поїздка захопила мене ще до того, як почалась. – Розповідає студент-волонтер факультету ЕлІТ Стас Федорчук. – Коли ми прибули на Хрещатик, нас зустрів помічник-консультант народного депутата Павло Дацків (який навчався колись на тій спеціальності, що і я зараз). Він супроводжував нас до самої Верховної Ради. У ВРУ було дуже круто: прекрасний екскурсовод, привітні депутати та загальна атмосфера. Я запам’ятаю це надовго!».

Окрім екскурсії Верховною Радою студенти відвідали найголовнішу християнську святиню Східної Європи - Софійський собор. Він є пам’яткою української архітектури, яка залишилася ще з часів Київської Русі, тому молоді було надзвичайно цікаво дізнатися про факти найстарішої споруди Києва.

Екскурсовод розповіла про історію заснування собору та зміни, які відбувалися протягом довгих років, показала мозаїки на його величних стінах. Також там містяться і фрески, які уціліли на сьогоднішній день. Ще однією цікавинкою став саркофаг Ярослава Мудрого. Також у Софії Київській є унікальне панно Богородиці, викладене з 15 тисяч писанок. Після розповідей екскурсовода кожен мав час, щоб добре розгледіти таємничі куточки музею та подивитися й інші будівлі на території собору, зокрема галереї.

«Не дивлячись на те, що я була в Києві декілька разів, мені вдалося дізнатися багато чого цікавого та нового. Я пережила неймовірні емоції», - поділилася враженнями волонтер Аня Тарануха.

            ',
            'photo' => '',
            'slug' => '4',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-02-11 11:55:17',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Благодійний «Общажник» зібрав сотню людей",
            'text' => '

7 лютого Волонтери СумДУ організували найатмосфернішу подію цієї зими - благодійний «Общажник». Метою заходу став збір коштів Олені Багі, дівчинці, яка лікується у Сумському гематологічному відділенні. На музичний вечір прийшло близько сотні людей, що дало змогу зібрати 2170 грн. «Ми в праві впливати на долі інших людей, то чому б не допомогти тим, кому це необхідно? Тим паче, поєднуючи приємне з корисним», - коментує організатор заходу Анастасія Вихрова.

«Общажник» був традиційним, але експериментальним. Цей івент створений для того, аби познайомити молодь міста із новими музикантами, про яких ми не чули раніше. «Зазвичай, це була гра на гітарі, часто імпровізація. Та цього разу можна було почути мелодію скрипки та сопілки», - повідомила соорганізатор заходу Вікторія Гичкаленко.

На вечорі свої таланти демонстрували 7 учасників. Серед них були сопілкар Тетяна Шатілова, яка веде свої курси гри на сопілці та скрипачка Вероніка Бабич, яка займається музикою уже 8 років. З власними піснями виступив і організатор фестивалю «Sumy Rock Fest» Володимир Луговий. Також свою творчість презентували молоді дуети «Ноябрь-17» ,"The last intention" та "INUA", які виконували кавери на сучасних музикантів.

Хедлайнерами заходу були хлопці із групи «DEINDE». Соліст гурту Семен, розповів, що це вже третій «Общажник», на якому вони виступають, а ще, зовсім скоро вийде їх перший альбом «Хвилі».

Лампова атмосфера, килими, гарячий чай та печиво створили домашній затишок та комфорт. У теплому колі зовсім різних людей запанувала єдність – єдність, заради спільної мети!
            ',
            'photo' => '',
            'slug' => '3',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-02-11 13:09:34',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Волонтери СумДУ влаштували флешмоб до Дня закоханих",
            'text' => '14 лютого волонтери СумДУ спільно з учасниками фольклорно-краєзнавчого гуртка «Краяни» організували масштабний флешмоб.
            На площі біля центрального корпусу зібралося понад 100 студентів, представників інститутів та факультетів університету,
            які об’єдналися у велике серце. Таким чином вони показали свою любов до навчального закладу у день, коли зізнаються у коханні. Кожен, хто долучився до заходу,
            отримав червону кульку та сертифікат на 100 гривень від спонсору \'Компсервіс\'. Під час флешмобу грала романтична музика, 
            охочі мали можливість зробити чудові фото. Окрім цього продавалися марципани, що були виготовлені власноруч студенткою Медичного інституту
            Надією Лебедєвою. Виручені кошти у сумі 500 гривень волонтери перерахувати на лікування онкохворій дівчинці із м.Суми Адріані Денисенко.
            До організації тематичного заходу приєдналися і волонтери студентської соціальної служби. Вони відвідали відділення денного перебування \'Злагода\'
            КУ «Сумського міського територіального центру соціального обслуговування \'Берегиня\'\' та разом із його вихованцями виготовили привітальні
            листівки до Дня Святого Валентина! Усі залишилася задоволеними та з подарунками.
            Дякуємо усім студентам інститутів та факультетів СумДУ, які долучилися до цього дійства.
            Саме завдяки вам ми показали, що Сумський державний університет це одна велика родина!',
            'photo' => '',
            'slug' => '2',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-02-15 15:21:18',
            'updated_at' => null,
        ]);
        DB::table('news')->insert([
            'published' => "1",
            'title' => "Волонтери СумДУ завітали до Центру соціально-психологічної реабілітації дітей області",
            'text' => '16 лютого волонтери СумДУ відвідали Центр соціально-психічної реабілітації для дітей області, візити до якого вже стали доброю традицією.
            Під час відвідин для дітлахів провели майстер-клас з малювання звірів за допомогою цікавої техніки, розповіли декілька лайфхаків та просто гарно провели суботній день. Вихованці щиро цікавилися справами волонтерів, а студенти у свою чергу дізнавалися про вподобання та захоплення дітлахів. Старші діти запитували про навчання в університеті та як обирати професію. По закінченню майстер-класу дітлахи почали робити власні вітальні листівки.
            Родзинкою заходу стало привітання одного з вихованців центру з днем народження. 8-ми річному Стасу подарували іграшку-трансформер, якою одразу ж зацікавились усі хлопці.
            ',
            'photo' => '',
            'slug' => '1',
            'meta_description' => '',
            'meta_keywords' => '',
            'created_at' => '2019-02-18 15:30:07',
            'updated_at' => null,
        ]);

    }
}
