<?php

use Illuminate\Database\Seeder;

class PagesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('pages')->insert([
            'first_title' => 'Інформація про наш відділ',
            'description' => 'В усіх цих державах, крім обов\'язкового соціального забезпечення, існувало також необов\'язкове забезпечення різних родів порядком угод з приватними товариствами. Обов\'язкове соціальне забезпечення ґрунтувалося на співдії застрахованих робітників і службовців у вигляді сплачування внесків визначеного законом розміру. У деяких випадках ці внески сплачували роботодавці (при страхуванні від хвороби і від нещасних випадків на роботі). У створенні фондів безробіття брала участь також держава бюджетними дотаціями.',
            'meta_description' => '',
            'meta_keywords' => '',
        ]);
        DB::table('pages')->insert([
            'first_title' => 'Соціальна служба',
            'description' => 'Волонтерство – форма благодійності, що здійснюється добровільно, безкорисливо та усвідомлено фізичними особами, що виражається через особисте надання робіт та послуг та ґрунтується на принципах законності, гуманності, гласності, рівності та здійснюється для досягнення суспільно-значимих цілей. Відповідно, є сенс закріпити дане визначення у частині 1 статті 1 Закону України «Про волонтерську діяльність». Вважається, що роком виникнення волонтерського руху є 1859 р. Адже саме цього року журналіст Анрі Дюнан після битви під Сольферіно запропонував створити Червоний Хрест як об\'єднання, члени якого працювали б на добровільних, безоплатних умовах, надаючи першу медичну допомогу пораненим бійцям. У 1920 році у Франції, поблизу міста Страсбург, реалізовано волонтерський проект щодо відновлення пошкоджених через бойові дії ферм, в якому взяла участь французька та німецька молодь.',
            'meta_description' => '',
            'meta_keywords' => '',
        ]);

        DB::table('pages')->insert([
            'first_title' => 'Волонтерський рух',
            'description' => 'Волонтерство – форма благодійності, що здійснюється добровільно, безкорисливо та усвідомлено фізичними особами, що виражається через особисте надання робіт та послуг та ґрунтується на принципах законності, гуманності, гласності, рівності та здійснюється для досягнення суспільно-значимих цілей. Відповідно, є сенс закріпити дане визначення у частині 1 статті 1 Закону України «Про волонтерську діяльність». Вважається, що роком виникнення волонтерського руху є 1859 р. Адже саме цього року журналіст Анрі Дюнан після битви під Сольферіно запропонував створити Червоний Хрест як об\'єднання, члени якого працювали б на добровільних, безоплатних умовах, надаючи першу медичну допомогу пораненим бійцям. У 1920 році у Франції, поблизу міста Страсбург, реалізовано волонтерський проект щодо відновлення пошкоджених через бойові дії ферм, в якому взяла участь французька та німецька молодь.',
            'meta_description' => '',
            'meta_keywords' => '',
        ]);
        DB::table('pages')->insert([
            'first_title' => 'Стипендіальне забезпечення',
            'description' => '',
            'meta_description' => '',
            'meta_keywords' => 'стипендії, СумДУ',
        ]);
        DB::table('pages')->insert([
            'first_title' => 'Карта добрих справ',
            'description' => '',
            'meta_description' => '',
            'meta_keywords' => 'карта, волонтерство,',
        ]);
        DB::table('pages')->insert([
            'first_title' => 'Фотоальбоми',
            'description' => '',
            'meta_description' => '',
            'meta_keywords' => 'фото',
        ]);
        DB::table('pages')->insert([
            'first_title' => 'Новини',
            'description' => '',
            'meta_description' => 'Актуальні новини',
            'meta_keywords' => 'новини',
        ]);
    }
}
