<?php

return [
    'title' => 'Заголовок',
    'photo' => 'Зображення',
    'content' => 'Зміст',
    'link' => 'Посилання',
    'relation' => 'Зв\'язок',
    'description' => 'Зміст',
    'emploee' => 'Співробітник',
    'workers' => 'Співробітники',
    'pib' => 'ПІБ',
    'fpib' => 'Прізвище Ім\'я по Батькові',
    'edit' => 'Редагувати',
    'back' => 'Назад',
    'preview' => 'Предперегляд',
    'meta_keywords' => 'Ключові слова для пошуку',
    'meta_description' => 'Коротникий опис для пошуку',
    'type' => 'Відношення'
];